Repository: BIMSEA/addins-excelexporterimporter
Catalog: ExcelExporterImporter/Resources.*.resx
Languages: fr

# WarningRevitFileNotSaved
source: The current document contains unsaved changes. Please save the current file and try again.
fr: Le document actuel contient des modifications non enregistrées. Sauvegardez le fichier actuel et réessayez.

# WarningRevitFileNotSavedTitle
source: File Not Saved
fr: Fichier non enregistré

# FileInUseTitle
source: File In Use
fr: Fichier en cours d'utilisation

# FileInUseMessage
source: The action can't be completed because the file is open in another program. Close the file and try again.
fr: L'action ne peut pas être terminée, car le fichier est ouvert dans un autre programme. Fermez le fichier et réessayez.

# SelectTargetFolderTitle
source: Target Folder is Empty
fr: Le dossier cible est vide

# SelectTargetFolderMessage
source: Please select a destination folder.
fr: Veuillez sélectionner un dossier de destination.

# NothingToExportMessage
source: Please select schedule(s) or standard(s) to export.
fr: Veuillez sélectionner les programmes ou les normes à exporter.

# NothingToExportTitle
source: Empty Selection
fr: Sélection vide

# ExportProcessCompleteMessage
source: The export process was completed successfully.
fr: Le processus d'exportation s'est terminé avec succès.

# ProcessCompleteTitle
source: Operation Complete
fr: Opération terminée

# ExportErrorMessage
source: An error occurred while exporting data: {0}
fr: Une erreur s'est produite lors de l'exportation des données: {0}

source: Error
fr: Erreur

# ConfirmOverwriteFile
source: Confirm Save
fr: Confirmer l'enregistrement

# ConfirmSaveMessage
source: {0} already exists. Do you want to replace it?
fr: {0} existe déjà. Voulez-vous le remplacer ?

# ExportProgressExporting
source: Exporting "{0}"
fr: Exportation "{0}"

# ImportNoSelection
source: Please select worksheet(s) to import.
fr: Veuillez sélectionner les feuilles de calcul à importer.

# ImportNoFileSelectedTitle
source: No File Selected
fr: Aucun fichier sélectionné

# ImportNoFileSelected
source: Select a file to import data from.
fr: Sélectionnez un fichier pour importer les données.

# ProgressImportingExcelData
source: Importing Excel data...
fr: Importer des données Excel ...

# ImportErrorMessage
source: An error occurred while importing data: {0}
fr: Une erreur s'est produite lors de l'importation des données: {0}

# ImportProcessCompleteMessage
source: The import process was completed successfully.
fr: Le processus d'importation s'est terminé avec succès.

source: Import unavailable
fr: Importation non disponible

# ImportUnavailableMsg
source: There is no data that can be imported.
fr: Il n'y a aucune donnée qui peut être importée.

source: Invalid excel file
fr: Fichier Excel non valide

# InvalidExcelFileMessage
source: You must use an excel file that has been exported by this component. See help for more information.
fr: Vous devez utiliser un fichier Excel qui a été exporté par ce composant. Consultez l'aide pour en savoir plus.

# DoYouNeedHelp
source: Do you need help? Do you want to report an issue?
fr: Avez-vous besoin d'aide? Souhaitez-vous signaler un problème ?

source: Open a ticket
fr: Ouvrir un billet

# Schedule
source: Schedules
fr: Nomenclatures

source: Browse...
fr: Parcourir...

source: Cancel
fr: Annuler

source: Cannot convert ParameterType
fr: Impossible de convertir le type de paramètre

source: Check all
fr: Tout cocher

source: Check None
fr: Rien cocher

# ErrorOccurredWhileSettingParameter
source: Error occurred while setting parameter {0} : {1}
fr: Une erreur s'est produite lors de la définition du paramètre {0}: {1}

source: EXPORT
fr: EXPORTER

source: Export Options
fr: Options d'exportation

source: File :
fr: Fichier :

source: IMPORT
fr: IMPORTER

# ImportElementFormExcelFile
source: Import Elements From Excel File
fr: Importer des éléments depuis un fichier Excel

# ImportingElement
source: Importing element: {0} ({1})
fr: Élément importé : {0} ({1})

source: One file, one tab per schedule
fr: Un fichier, un onglet par nomenclature

source: One file per schedule
fr: Un fichier par nomenclature

source: Output folder :
fr: Répertoire de sortie :

source: Prefix :
fr: Préfixe :

source: to a UnitType.
fr: à un type d'unité.

# UnableFindCorrespondingValue
source: Unable to find a corresponding value for the specified text ({0}).
fr: Impossible de trouver une valeur correspondante pour le texte spécifié ({0}).

source: Cancel the export process
fr: Annuler le processus d'exportation

# CouldNotDeleteFile
source: Unable to delete file {0}, the process cannot continue. If the file is currently open, you must close it to continue.
fr: Impossible de supprimer le fichier {0}, le processus ne peut pas continuer. Si le fichier est présentement ouvert, vous devez le fermer pour poursuivre.

source: Overwrite target files
fr: Écraser les fichiers cibles

source: Overwrite the existing files
fr: Écraser les fichiers existants

# TargetFileAlreadyExists
source: Target file(s) already exists
fr: Le ou les fichiers cibles existent déjà

# TheFileAlreadyExists
source: The file {0} already exists.
fr: Le fichier {0} existe déjà.

# TheTargetFolderAlreadyContainsFiles
source: The target folder already contains {0} files with conflicting names
fr: Le répertoire cible contient déjà {0} fichiers avec des noms en conflit

source: Completed with errors
fr: Terminé avec des erreurs

# Exporting
source: Exporting {0}
fr: Exportation de {0}

# IsNotKnownStandardGuid
source: is not a known standard guid.
fr: n'est pas un guide standard connu.

# Schedule2
source: Schedule {0} : {1}
fr: Nomenclature {0} : {1}

source: Some elements could not be imported.
fr: Certains éléments n'ont pas pu être importés.

source: The import process was completed with errors.
fr: Le processus d'importation s'est terminé avec des erreurs.

source: This sheet can not be imported.
fr: Cette feuille ne peut être importée.

source: View Details
fr: Voir les détails

source: Analytical Model Objects
fr: Objets du modèle analytique

source: Annotation Objects
fr: Objets d'annotation

source: Appearance
fr: Apparence

source: Categories
fr: Catégories

source: Category
fr: Catégorie

source: Cut Pattern
fr: Motif de coupe

source: Cut Pattern Color (R-G-B)
fr: Couleur du motif de coupe (R-G-B)

source: Family Listing
fr: Liste des familles

source: Graphics
fr: Graphique

source: Group
fr: Groupe

source: Instance Binding
fr: Liaison d'instance

source: Is Shared
fr: Est partagé

source: Line Color (R,G,B)
fr: Couleur de la ligne (R,G,B)

source: Line Styles
fr: Styles de ligne

source: Line Weight - Cut
fr: Épaisseur de la ligne - Coupe

source: Line Weight - Projection
fr: Épaisseur de la ligne - Projection

source: Materials
fr: Matériaux

source: Materials (All used)
fr: Matériaux (Tous utilisés)

source: Model Objects
fr: Objets de modèle

source: Name
fr: Nom

source: Object Styles
fr: Styles d'objets

source: Owner Group Name
fr: Nom du groupe propriétaires

source: Project Information
fr: Informations sur le projet

source: Project Parameters
fr: Paramètres du projet

source: Project Parameters Settings
fr: Paramètres du projet

source: Properties
fr: Propriétés

source: Shading Color (R-G-B)
fr: Couleur d'ombrage (R-G-B)

source: Shared Parameters Settings
fr: Paramètres partagés

source: Shared Project Parameters
fr: Paramètres de projet partagés

source: Sheet Listing
fr: Liste des feuilles

source: Sheet Listing (All)
fr: Liste des feuilles (Toutes)

source: Sheet Name
fr: Nom de la feuille

source: Sheet Number
fr: Numéro de feuille

source: Surface Pattern
fr: Motif de surface

source: Surface Pattern Alignment
fr: Alignement du motif de surface

source: Surface Pattern Color (R-G-B)
fr: Couleur du motif de surface (R-G-B)

source: Use Render Appearance for Shading
fr: Utiliser l'apparence de rendu pour l'ombrage

source: Value
fr: Valeur

source: View Listing
fr: Liste des vues

source: View Listing (All)
fr: Liste des vues (Toutes)

source: View Name
fr: Nom de la vue

source: User Modifiable
fr: Modifiable par l'utilisateur

# TabExportAdvanced
source: Export (Advanced)
fr: Exporter (Avancé)

# TabExportBasic
source: Export (Basic)
fr: Exporter (Base)

# CannotConnectToServeur
source: Cannot connect to server
fr: Connexion au serveur impossible

source: Click here for more information
fr: Cliquez ici pour plus d'information

# WarningFormula
source: Warning: The values of formula columns are not exported in advanced mode. You can use the basic mode to export the results of the formula.
fr: Avertissement : Les valeurs des colonnes de type formule ne sont pas exportées dans le mode avancé. Vous pouvez utiliser le mode de base pour exporter les résultats de la formule.

# clColTitleColor
source: Color
fr: Couleur

# clDescChangingValueParameterAllowed
source: Changing the value of the parameter is allowed
fr: Modification de la valeur du paramètre est autorisé

# clDescColumnTitle
source: Column title
fr: Titre de la colonne

# clDescParameterValueLocked
source: Parameter value locked and which cannot be modified for import
fr: Valeur du paramètre verrouillé et qui ne peut être modifié pour l'importation

# clDescSubTotalLevel1
source: Sub-total level 1
fr: Sous total niveau 1

# clDescSubTotalLevel2
source: Sub total level 2 and above
fr: Sous total niveau 2 et plus

# clDescValueLockedElementType
source: Value of a locked item type parameter
fr: Valeur d'un paramètre de type d'élément verrouillé

# clDescValueParameterNotExported
source: Value of a parameter which cannot be exported
fr: Valeur d'un paramètre qui ne peut être exporté

# clDescValueType
source: Value type
fr: Type de valeur

# clLegend
source: Legend
fr: Légende

# clLegendTitle
source: Color legend
fr: Légende des couleurs

# NoticeExportAvanced
source: Bidirectional - Import possible but modified formatting.
fr: Bidirectionnel - L'import possible, mais la mise en forme est modifiée.

# NoticeExportBasic
source: Unidirectional - Keeps formatting but import impossible.
fr: Unidirectionnel - Conserve la mise en forme, mais l'import est impossible.

# NoticeImport
source: Allows the import of data via an exported schedule in bidirectional mode.
fr: Permets l'import de données via une nomenclature exportée en mode bidirectionnel.

source: Export mode
fr: Mode d'export

source: Exit
fr: Quitter

source: Help
fr: Aide

source: Unable to delete file
fr: Impossible de supprimer le fichier

# AvailableImport
source: Compatible for import
fr: Compatible pour l'import

# NotAvailableForImport
source: Not compatible for import
fr: Non compatible pour l'import

# TitleBtnExport
source: Export
fr: Exporter

# TitleBtnImport
source: Import
fr: Importer

# AreYouSureYouWantCancelProcess
source: Are you sure you want to cancel this process?
fr: Voulez-vous vraiment annuler ce processus ?

source: Cancelling...
fr: Annulation...
